artillery-test/script.sample.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "TARGET_URL_PLEASE_CHANGE"
  phases:
    -
      duration: 10
      arrivalRate: 10
scenarios:
  - flow:
      - get:
          url: "/"
      - post:
          url: "/login"
          form:
            email: "test@example.com"
            password: "donuts"
      - post:
          url: "/post_from_form"
          form:
            value: "value1"
            value2: "value2"